Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 97)]         0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          12544       input_1[0][0]                    
__________________________________________________________________________________________________
air1 (Dense)                    (None, 1)            129         dense[0][0]                      
__________________________________________________________________________________________________
clotheswasher1 (Dense)          (None, 1)            129         dense[0][0]                      
__________________________________________________________________________________________________
dishwasher1 (Dense)             (None, 1)            129         dense[0][0]                      
__________________________________________________________________________________________________
furnace1 (Dense)                (None, 1)            129         dense[0][0]                      
__________________________________________________________________________________________________
refrigerator1 (Dense)           (None, 1)            129         dense[0][0]                      
==================================================================================================
Total params: 13,189
Trainable params: 13,189
Non-trainable params: 0
__________________________________________________________________________________________________
