Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 97)]         0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 97)]         0                                            
__________________________________________________________________________________________________
tf_op_layer_Size (TensorFlowOpL [()]                 0           input_1[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_Size_1 (TensorFlowO [()]                 0           input_2[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_truediv/Cast (Tenso [()]                 0           tf_op_layer_Size[0][0]           
__________________________________________________________________________________________________
tf_op_layer_truediv_1/Cast (Ten [()]                 0           tf_op_layer_Size_1[0][0]         
__________________________________________________________________________________________________
tf_op_layer_truediv (TensorFlow [()]                 0           tf_op_layer_truediv/Cast[0][0]   
__________________________________________________________________________________________________
tf_op_layer_truediv_1 (TensorFl [()]                 0           tf_op_layer_truediv_1/Cast[0][0] 
__________________________________________________________________________________________________
tf_op_layer_Reshape/Cast (Tenso [()]                 0           tf_op_layer_truediv[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape_1/Cast (Ten [()]                 0           tf_op_layer_truediv_1[0][0]      
__________________________________________________________________________________________________
tf_op_layer_Reshape/shape (Tens [(3,)]               0           tf_op_layer_Reshape/Cast[0][0]   
__________________________________________________________________________________________________
tf_op_layer_Reshape_1/shape (Te [(3,)]               0           tf_op_layer_Reshape_1/Cast[0][0] 
__________________________________________________________________________________________________
tf_op_layer_Reshape (TensorFlow [(None, 1, 97)]      0           input_1[0][0]                    
                                                                 tf_op_layer_Reshape/shape[0][0]  
__________________________________________________________________________________________________
tf_op_layer_Reshape_1 (TensorFl [(None, 1, 97)]      0           input_2[0][0]                    
                                                                 tf_op_layer_Reshape_1/shape[0][0]
__________________________________________________________________________________________________
lstm (LSTM)                     (None, 128)          115712      tf_op_layer_Reshape[0][0]        
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 128)          115712      tf_op_layer_Reshape_1[0][0]      
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           4128        lstm[0][0]                       
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 32)           4128        lstm_1[0][0]                     
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64)           0           dense[0][0]                      
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 16)           1040        concatenate[0][0]                
__________________________________________________________________________________________________
air1 (Dense)                    (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
air2 (Dense)                    (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
air3 (Dense)                    (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
airwindowunit1 (Dense)          (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
aquarium1 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
bathroom1 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
bathroom2 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
bedroom1 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
bedroom2 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
bedroom3 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
bedroom4 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
bedroom5 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
battery1 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
car1 (Dense)                    (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
car2 (Dense)                    (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
circpump1 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
clotheswasher1 (Dense)          (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
clotheswasher_dryg1 (Dense)     (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
diningroom1 (Dense)             (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
diningroom2 (Dense)             (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
dishwasher1 (Dense)             (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
disposal1 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
drye1 (Dense)                   (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
dryg1 (Dense)                   (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
freezer1 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
furnace1 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
furnace2 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
garage1 (Dense)                 (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
garage2 (Dense)                 (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
heater1 (Dense)                 (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
heater2 (Dense)                 (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
heater3 (Dense)                 (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
housefan1 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
icemaker1 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
jacuzzi1 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
kitchen1 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
kitchen2 (Dense)                (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
kitchenapp1 (Dense)             (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
kitchenapp2 (Dense)             (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
lights_plugs1 (Dense)           (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
lights_plugs2 (Dense)           (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
lights_plugs3 (Dense)           (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
lights_plugs4 (Dense)           (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
lights_plugs5 (Dense)           (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
lights_plugs6 (Dense)           (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
livingroom1 (Dense)             (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
livingroom2 (Dense)             (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
microwave1 (Dense)              (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
office1 (Dense)                 (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
outsidelights_plugs1 (Dense)    (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
outsidelights_plugs2 (Dense)    (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
oven1 (Dense)                   (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
oven2 (Dense)                   (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
pool1 (Dense)                   (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
pool2 (Dense)                   (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
poollight1 (Dense)              (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
poolpump1 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
pump1 (Dense)                   (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
range1 (Dense)                  (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
refrigerator1 (Dense)           (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
refrigerator2 (Dense)           (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
security1 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
sewerpump1 (Dense)              (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
shed1 (Dense)                   (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
solar (Dense)                   (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
solar2 (Dense)                  (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
sprinkler1 (Dense)              (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
sumppump1 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
utilityroom1 (Dense)            (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
venthood1 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
waterheater1 (Dense)            (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
waterheater2 (Dense)            (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
wellpump1 (Dense)               (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
winecooler1 (Dense)             (None, 1)            17          dense_2[0][0]                    
==================================================================================================
Total params: 241,978
Trainable params: 241,978
Non-trainable params: 0
__________________________________________________________________________________________________
