Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 97)]         0                                            
__________________________________________________________________________________________________
tf_op_layer_Size (TensorFlowOpL [()]                 0           input_1[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_truediv/Cast (Tenso [()]                 0           tf_op_layer_Size[0][0]           
__________________________________________________________________________________________________
tf_op_layer_truediv (TensorFlow [()]                 0           tf_op_layer_truediv/Cast[0][0]   
__________________________________________________________________________________________________
tf_op_layer_Reshape/Cast (Tenso [()]                 0           tf_op_layer_truediv[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape/shape (Tens [(3,)]               0           tf_op_layer_Reshape/Cast[0][0]   
__________________________________________________________________________________________________
tf_op_layer_Reshape (TensorFlow [(None, 1, 97)]      0           input_1[0][0]                    
                                                                 tf_op_layer_Reshape/shape[0][0]  
__________________________________________________________________________________________________
lstm (LSTM)                     (None, 128)          115712      tf_op_layer_Reshape[0][0]        
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          16512       lstm[0][0]                       
__________________________________________________________________________________________________
air1 (Dense)                    (None, 1)            129         dense[0][0]                      
__________________________________________________________________________________________________
clotheswasher1 (Dense)          (None, 1)            129         dense[0][0]                      
__________________________________________________________________________________________________
dishwasher1 (Dense)             (None, 1)            129         dense[0][0]                      
__________________________________________________________________________________________________
furnace1 (Dense)                (None, 1)            129         dense[0][0]                      
__________________________________________________________________________________________________
refrigerator1 (Dense)           (None, 1)            129         dense[0][0]                      
__________________________________________________________________________________________________
solar (Dense)                   (None, 1)            129         dense[0][0]                      
==================================================================================================
Total params: 132,998
Trainable params: 132,998
Non-trainable params: 0
__________________________________________________________________________________________________
