Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 97)]         0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 97)]         0                                            
__________________________________________________________________________________________________
tf_op_layer_Size (TensorFlowOpL [()]                 0           input_1[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_Size_1 (TensorFlowO [()]                 0           input_2[0][0]                    
__________________________________________________________________________________________________
tf_op_layer_Cast (TensorFlowOpL [()]                 0           tf_op_layer_Size[0][0]           
__________________________________________________________________________________________________
tf_op_layer_Cast_1 (TensorFlowO [()]                 0           tf_op_layer_Size_1[0][0]         
__________________________________________________________________________________________________
tf_op_layer_RealDiv (TensorFlow [()]                 0           tf_op_layer_Cast[0][0]           
__________________________________________________________________________________________________
tf_op_layer_RealDiv_1 (TensorFl [()]                 0           tf_op_layer_Cast_1[0][0]         
__________________________________________________________________________________________________
tf_op_layer_Reshape/Cast (Tenso [()]                 0           tf_op_layer_RealDiv[0][0]        
__________________________________________________________________________________________________
tf_op_layer_Reshape_1/Cast (Ten [()]                 0           tf_op_layer_RealDiv_1[0][0]      
__________________________________________________________________________________________________
tf_op_layer_Reshape/shape (Tens [(3,)]               0           tf_op_layer_Reshape/Cast[0][0]   
__________________________________________________________________________________________________
tf_op_layer_Reshape_1/shape (Te [(3,)]               0           tf_op_layer_Reshape_1/Cast[0][0] 
__________________________________________________________________________________________________
tf_op_layer_Reshape (TensorFlow [(None, 1, 97)]      0           input_1[0][0]                    
                                                                 tf_op_layer_Reshape/shape[0][0]  
__________________________________________________________________________________________________
tf_op_layer_Reshape_1 (TensorFl [(None, 1, 97)]      0           input_2[0][0]                    
                                                                 tf_op_layer_Reshape_1/shape[0][0]
__________________________________________________________________________________________________
lstm (LSTM)                     (None, 128)          115712      tf_op_layer_Reshape[0][0]        
__________________________________________________________________________________________________
lstm_1 (LSTM)                   (None, 128)          115712      tf_op_layer_Reshape_1[0][0]      
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           4128        lstm[0][0]                       
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 32)           4128        lstm_1[0][0]                     
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 64)           0           dense[0][0]                      
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 16)           1040        concatenate[0][0]                
__________________________________________________________________________________________________
air1 (Dense)                    (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
clotheswasher1 (Dense)          (None, 1)            17          dense_2[0][0]                    
__________________________________________________________________________________________________
dishwasher1 (Dense)             (None, 1)            17          dense_2[0][0]                    
==================================================================================================
Total params: 240,771
Trainable params: 240,771
Non-trainable params: 0
__________________________________________________________________________________________________
